Repository: IBM/watson-translator-101
Catalog: en-fr-6000-ParallelCorpus.tmx
Source language: en
Languages: fr

source: New legislation had paved the way for mutual savings and loan mechanisms targeted at women, and the country's various social funds supported entrepreneurial ventures by women.
fr: Une nouvelle législation a permis de mettre en place des mutuelles d'épargne et de prêts destinées aux femmes et les différents fonds sociaux du pays appuient des créations d'entreprises lancées par des femmes.

source: The Government was aware that it had much work to do to fulfil its Beijing commitments, but the crisis which had begun in September 2002 had seriously hampered efforts to tackle poverty among women.
fr: Le Gouvernement est conscient qu'il reste encore beaucoup à faire pour remplir les engagements qu'il a contractés à Beijing mais la crise qui a éclaté en septembre 2002 a gravement compromis les efforts qu'il fait pour s'attaquer au problème de la pauvreté parmi les femmes.

source: One of the new challenges was to improve women's ability to play a part in conflict resolution.
fr: Un des nouveaux défis à relever consiste à améliorer l'aptitude des femmes à participer au règlement des conflits.

source: Ms. Al-Muzaini (Kuwait) said that the report of the Secretary-General on violence against women, which was the result of the first ever General Assembly mandate for a study on the subject, would help to provide a benchmark for future action.
fr: Mme Al-Muzaini (Koweït) dit que le rapport du Secrétaire général sur la violence à l'égard des femmes, établi après que l'Assemblée générale eut pour la première fois demandé une étude sur la question, pourrait aider à définir de nouveaux critères d'action pour l'avenir.

source: All discrimination against women stood in the way of equity, equality and justice, principles which Kuwait had enshrined in its Constitution.
fr: Toutes les formes de discrimination à l'égard des femmes vont à l'encontre des principes d'équité, d'égalité et de justice que le Koweït consacre dans sa Constitution.

source: Kuwait had acceded to the Convention on the Elimination of All Forms of Discrimination against Women in 1994, incorporating the Convention into its national law.
fr: Le Koweït a adhéré à la Convention sur l'élimination de toutes les formes de discrimination à l'égard des femmes en 1994, incorporant les dispositions de cet instrument dans son droit interne.

source: It had submitted two reports to the Committee on the Elimination of Discrimination against Women, and a combined third and fourth report was in preparation.
fr: Il a aussi soumis deux rapports au Comité pour l'élimination de la discrimination à l'égard des femmes et un troisième et quatrième rapport est en cours d'établissement.

source: In May 2005, the Kuwaiti parliament had amended the Electoral Act to enable women to participate in parliamentary elections for the first time.
fr: En mai 2005, le Parlement koweïtien a amendé la loi électorale afin de permettre aux femmes de participer pour la première fois aux élections parlementaires.

source: Kuwait would accordingly withdraw its reservation to Article 7, paragraph (a) of the Convention.
fr: Il retirera donc la réserve qu'il a exprimée à propos du paragraphe a) de l'article 7 de la Convention.

source: Women had been appointed to cabinet-level positions in the Government and occupied more and more leadership positions, especially in municipal authorities.
fr: Certaines femmes ont été nommées à des postes ministériels et de plus en plus nombreuses sont celles qui occupent des postes de responsabilité, notamment au niveau de l'administration municipale.
